AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<Comment>(Регл)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДополнительный</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсходнойПроводки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратТекущегоМесяца</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Enums/ВедениеВзаиморасчетовПоДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВедениеВзаиморасчетовПоДоговорам</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоДоговоруВЦелом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПоРасчетнымДокументам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЗаказам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСчетам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровКонтрагентов</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бартерный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/umk_РаботаСДиалогами/Ext/Module.bsl
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С ГПУ ПРЕДСТАВЛЕНИЯ ДАННЫХ


// Процедура формирует и выводит текст в информационной надписи о величине долга контрагента.
//
// Параметры:
//  ДоговорКонтрагента    - ссылка на справочник, определяет договор контрагента; 
//  Сделка                   - ссылка на документ или Неопределено, определяет сделку; 
//  ЭлементФормыНадписьДолга - элемент формы, содержащий надпись долга;
//  СсылкаДокумент           - ссылка на документ, из которого вызывается процедура.
//  МожноНеРассчитывать      - если можно не рассчитывать долг, а в дополнительных правах "Рассчитывать долг при открытии форм" = ложь,
//                             то величина долга рассчитываться не будет
//
Процедура СформироватьНадписьДолга(ДоговорКонтрагента, Сделка, ЭлементФормыНадписьДолга, 
	                                 СсылкаДокумент = Неопределено, МожноНеРассчитывать = Ложь) Экспорт

	Если МожноНеРассчитывать Тогда
		Если НЕ УправлениеДопПравамиПользователей.РассчитыватьДолгПриОткрытииФорм() Тогда
			ЭлементФормыНадписьДолга.Заголовок = ПолучитьТекстДолга(ДоговорКонтрагента, Неопределено, Неопределено);
			Возврат;
		КонецЕсли;
	КонецЕсли;

	Если ТипЗнч(ДоговорКонтрагента) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		
		// Долг по отгрузкам	
		МассивСчетов_36 = Новый Массив();
		МассивСчетов_36.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСОтечественнымиПокупателями);

		СуммаДолга_36 = ТекущийДолг(ДоговорКонтрагента, Сделка, СсылкаДокумент, МассивСчетов_36, Истина);
		
		// Долг по авансам	
		МассивСчетов_68 = Новый Массив();
		МассивСчетов_68.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученнымВНациональнойВалюте);

		СуммаДолга_68 = ТекущийДолг(ДоговорКонтрагента, Сделка, СсылкаДокумент, МассивСчетов_68, Истина);
		
		СуммаДолгаПоСделке = СуммаДолга_36 + СуммаДолга_68;	
		
		// Долг не по сделке
		// Долг по отгрузкам	
		МассивСчетов_36 = Новый Массив();
		МассивСчетов_36.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСОтечественнымиПокупателями);

		СуммаДолга_36 = ТекущийДолг(ДоговорКонтрагента, Сделка, СсылкаДокумент, МассивСчетов_36);
		
		// Долг по авансам	
		МассивСчетов_68 = Новый Массив();
		МассивСчетов_68.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученнымВНациональнойВалюте);

		СуммаДолга_68 = ТекущийДолг(ДоговорКонтрагента, Сделка, СсылкаДокумент, МассивСчетов_68);
		
		СуммаДолга = СуммаДолга_36 + СуммаДолга_68;		


		ТекстДолга = ПолучитьТекстДолга(ДоговорКонтрагента, СуммаДолгаПоСделке, СуммаДолга);

		//Если СуммаДолгаПоСделке > 0 Тогда // Долг контрагента, покрасим текст в особый цвет
			//ЭлементФормыНадписьДолга.ЦветТекста = ЦветаСтиля.ТекстПредупреждающейНадписи;
		//Иначе
		ЭлементФормыНадписьДолга.ЦветТекста = ЦветаСтиля.ТекстИнформационнойНадписи;
		//КонецЕсли; 

		ЭлементФормыНадписьДолга.Заголовок = ТекстДолга;
	Иначе
		ЭлементФормыНадписьДолга.Заголовок = "";
	КонецЕсли; 

КонецПроцедуры // СформироватьНадписьДолга()

// Процедура формирует и выводит текст в информационной надписи о регионе контрагента
//
Процедура СформироватьНадписьРегион(Контрагент, ЭлементыФормыНадписьРегион, СсылкаДокемент = Неопределено) Экспорт
	
	ТекстРегион = "";  
	
	Если ЗначениеЗаполнено(Контрагент.Регион)
		Тогда
		
		Регион = Контрагент.Регион;
		ПервыйЭлемент = Истина; 
		ПоследнийЭлемент = Ложь;
		Счетчик = 0; // подстраховка от зацикливания временно
		
		Пока Истина Цикл
				
			ТекстРегион = Регион.Наименование + ?(ПервыйЭлемент ИЛИ ПоследнийЭлемент, "","/") + ТекстРегион;
			
			Если Не ЗначениеЗаполнено(Регион) Тогда
				ЭлементыФормыНадписьРегион.Заголовок = ТекстРегион;
				Прервать;
			КонецЕсли;
			Регион = Регион.Родитель;
			
			ПервыйЭлемент = Ложь;
			ПоследнийЭлемент = Не ЗначениеЗаполнено(Регион);
			
		Счетчик = Счетчик + 1;
		
		Если Счетчик = 500
			Тогда
			ТекстРегион = ".../" + Регион.Наименование + "/...";  
			ЭлементыФормыНадписьРегион.Заголовок = ТекстРегион;
			Прервать;
		КонецЕсли;
		
		КонецЦикла;
		
	Иначе
		
		ЭлементыФормыНадписьРегион.Заголовок = "" ;
		
	КонецЕсли;
	
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПОДГОТОВКИ ИНФОРМАЦИИ В ФОРМЕ

// Формирует текст о долге контрагента для вывода его в форме документа
//
// Параметры: 
//  ДоговорКонтрагента - ссылка на элемент справочника, определяет договор контрагента
//  Долг                  - число, сумма долга.
//
// Возвращаемое значение:
//  Строка, сформированный текст про долг контрагента.
//
Функция ПолучитьТекстДолга(ДоговорКонтрагента, Знач Долг, Знач ДолгОбщий) Экспорт

	// Общий долг
	ТекстПодписиОбщий = "";

	Если ДолгОбщий = Неопределено Тогда
		ТекстПодписиОбщий = ТекстПодписиОбщий + "В бух. учете долг не рассчитан";

	ИначеЕсли ДолгОбщий = 0 Тогда
		ТекстПодписиОбщий = ТекстПодписиОбщий + "В бух. учете нет долга";

	Иначе
		Если ДолгОбщий > 0 Тогда
			ТекстПодписиОбщий = ТекстПодписиОбщий + "В бух. учете долг контрагента";
		Иначе
			ТекстПодписиОбщий = ТекстПодписиОбщий + "В бух. учете долг компании";
			ДолгОбщий = (-1) * ДолгОбщий;
		КонецЕсли;

		ТекстПодписиОбщий = ТекстПодписиОбщий + " " +
		               ОбщегоНазначения.ФорматСумм(ДолгОбщий);

	КонецЕсли;

	
	
	// Долг по сделке.
	Если НЕ ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		Возврат "Введена не вся информация для расчета долга по сделке(договору).";
	КонецЕсли;

	ТекстПодписи = ?(ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом,
	               "В т.ч. по договору","В т.ч. по сделке");

	Если ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Прочее Тогда
		ТекстПодписи = ТекстПодписи + " """ + Нрег(ДоговорКонтрагента.ВидДоговора) + """";
	Иначе
		ТекстПодписи = ТекстПодписи + " " + Нрег(ДоговорКонтрагента.ВидДоговора);
	КонецЕсли;

	Если Долг = Неопределено Тогда
		ТекстПодписи = ТекстПодписи + " долг не рассчитан";

	ИначеЕсли Долг = 0 Тогда
		ТекстПодписи = ТекстПодписи + " нет долга";

	Иначе
		Если Долг > 0 Тогда
			ТекстПодписи = ТекстПодписи + " долг контрагента";
		Иначе
			ТекстПодписи = ТекстПодписи + " долг компании";
			Долг = (-1) * Долг;
		КонецЕсли;

		ТекстПодписи = ТекстПодписи + " " +
		               ОбщегоНазначения.ФорматСумм(Долг, ДоговорКонтрагента.ВалютаВзаиморасчетов);

	КонецЕсли;
				  
	ТекстПодписи = ТекстПодписиОбщий + ". "  + ТекстПодписи;			   

	Возврат ТекстПодписи;

КонецФункции // ПолучитьТекстДолга()

// Вычисляет текущий долг контрагента по заданному договору и сделке в валюте взаиморасчетов 
// по данному договору
//
// Параметры: 
//  Договор - ссылка на элемент справочника, определяет договор контрагента, по которому надо получить долг, 
//  Сделка  - ссылка на документ, определяет сделку (заказ, накладную, платежный документ) по которому надо получить долг.
//  СсылкаДокумент           - ссылка на документ, для которого рассчитывается долг.
//
// Возвращаемое значение:
//  Число -  текущий размер долга, если удалось вычислить текущий долг, иначе - 0.
//
Функция ТекущийДолг(Договор, Сделка = Неопределено, СсылкаДокумент, МассивСчетов, ПоСделке = Ложь) Экспорт

	ТекущийДолг = 0;
	
		ТекстЗапроса = 
			"ВЫБРАТЬ
			|	ХозрасчетныйОстатки.СуммаОстаток КАК Остаток
			|ИЗ
			|	РегистрБухгалтерии.Хозрасчетный.Остатки(
			|			,
			|			Счет В ИЕРАРХИИ (&Счета),
			|			,
			|			Субконто1 = &Контрагент
			|				И Субконто2 = &Договор
			|				И Субконто3 = &Сделка) КАК ХозрасчетныйОстатки";
		
	
	Если ЗначениеЗаполнено(Договор) Тогда
		
		Если Договор.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда			
						
			Текст = СтрЗаменить(ТекстЗапроса, "И Субконто3 = &Сделка","");
			
			Если Не ПоСделке Тогда
				 Текст = СтрЗаменить(Текст, "И Субконто2 = &Договор", "");
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст = Текст;
			
			Запрос.УстановитьПараметр("Договор", Договор);
			Запрос.УстановитьПараметр("Контрагент", Договор.Владелец);
			Запрос.УстановитьПараметр("Счета", МассивСчетов);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Если Выборка.Следующий() Тогда
				
				ТекущийДолг = Выборка.Остаток;
				
			КонецЕсли;
			
		Иначе // Взаиморасчеты ведутся по сделкам
			Если ЗначениеЗаполнено(Сделка) Тогда
				
				Запрос = Новый Запрос;
								
				Если Не ПоСделке Тогда
					ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И Субконто3 = &Сделка","");
					ТекстЗапроса= СтрЗаменить(ТекстЗапроса, "И Субконто2 = &Договор", "");
				КонецЕсли;
				
				Запрос.Текст = ТекстЗапроса;


				
				Запрос.УстановитьПараметр("Договор", Договор);
				Запрос.УстановитьПараметр("Контрагент", Договор.Владелец);
				Запрос.УстановитьПараметр("Сделка", Сделка);
				Запрос.УстановитьПараметр("Счета", МассивСчетов);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				Выборка = РезультатЗапроса.Выбрать();
				
				Если Выборка.Следующий() Тогда
					
					ТекущийДолг = Выборка.Остаток;
					
				КонецЕсли;
				
			КонецЕсли; 
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат ТекущийДолг;
	
КонецФункции // ТекущийДолг()

//Возвращает количество товара в расходной накладной и остаток с учетом всех возвратов
//ДокументСсылка - расходная накладная
Функция ВыборкаОстаткаПоТоварамНакладной(ДокументСсылка,Номенклатура,ХарактеристикаНоменклатуры,УпаковкаНаПечать) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Количество,
		|	РеализацияТоваровУслугТовары.Цена,
		|	ВложенныйЗапрос.ВозвратКоличество,
		|	РеализацияТоваровУслугТовары.Количество - ЕСТЬNULL(ВложенныйЗапрос.ВозвратКоличество, 0) КАК Остаток,
		|	ВложенныйЗапрос.ВозвратКоличество КАК Вернули
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СУММА(ВозвратТоваровОтПокупателяТовары.Количество) КАК ВозвратКоличество,
		|			ВозвратТоваровОтПокупателяТовары.Номенклатура КАК Номенклатура,
		|			ВозвратТоваровОтПокупателяТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
		|		ИЗ
		|			Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
		|		ГДЕ
		|			ВозвратТоваровОтПокупателяТовары.Номенклатура = &Номенклатура
		|			И ВозвратТоваровОтПокупателяТовары.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
		|			И ВозвратТоваровОтПокупателяТовары.ДокументПартии = &ДокументСсылка
		|			И ВозвратТоваровОтПокупателяТовары.Ссылка.Проведен = ИСТИНА
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ВозвратТоваровОтПокупателяТовары.Номенклатура,
		|			ВозвратТоваровОтПокупателяТовары.ХарактеристикаНоменклатуры) КАК ВложенныйЗапрос
		|		ПО РеализацияТоваровУслугТовары.Номенклатура = ВложенныйЗапрос.Номенклатура
		|			И РеализацияТоваровУслугТовары.ХарактеристикаНоменклатуры = ВложенныйЗапрос.ХарактеристикаНоменклатуры
		|ГДЕ
		|	РеализацияТоваровУслугТовары.Номенклатура = &Номенклатура
		|	И РеализацияТоваровУслугТовары.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
		|	И РеализацияТоваровУслугТовары.Ссылка = &ДокументСсылка";
	
	
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", ХарактеристикаНоменклатуры);
	//Запрос.УстановитьПараметр("umk_УпаковкаНаПечать", УпаковкаНаПечать);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать();

	
КонецФункции
